{"doc_id": 11262329, "author": "", "text": "No, there is no way to restore a deleted photo from a Facebook page. Once it's deleted, it's gone. https://www.facebook.com/help/208547132518386"}
{"doc_id": 11246408, "author": "", "text": "Facebook does not officially support changing the font on your profile. Some people manage to make it look like this by putting in script characters (Hindi, etc.) that look vaguely similar to English letters, or by combining Unicode characters. But this does have some downsides: A lot of people find it annoying. People searching for your name won't see it, because your name in Facebook's database won't actually be the characters of your name that people would be searching for. I would suggest that you not do this, but if you really want to, you'll have to look for special characters that look like letters."}
{"doc_id": 212138, "author": "", "text": "My wife and I own three Sigma lenses: the \"bigma\" (50-500mm), my 17-70mm f/2.8-4, and her 30mm f/1.4 prime. We absolutely love them, for their respective strengths: Noone touches the Bigma for range. Yes, it's soft. Yes, it's unbelievably big and heavy. But it's a disturbingly versatile lens. The 30mm is incredibly sharp, and f/1.4 is something you just have to use to understand why you want it. My 17-70mm is a great compromise lens; it's almost always attached to my camera, and I switch off when I have a particular need. And, quite frankly, it's tough to touch Sigma on price. As with all things, they have their good lenses and their bad lenses (just like Canon); be sure to check sites like photozone.de for quality tests before plunking down your money."}
{"doc_id": 248888, "author": "", "text": "Sometimes there are reports of entry level DSLRs camouflaged and sold as full frame ones. Recently, it was found out that some d7100s (dx) were modified and sold as d610s (fx). And some d800s ( with an anti aliasing filter) were modified and sold as d800Es. So it may be a canon, but a cheaper model."}
{"doc_id": 224413, "author": "", "text": "One way to potentially achieve infinity focus is to use a teleconverter. You'll have at least a 1.4x magnification factor, but this isn't any worse than using your lenses on a DX body. By the time you mount the TC and an adapter, not sure you'll be able to focus at infinity, but I imagine it would be possible. One interesting possibility: Nikon made a TC-16A teleconverter which takes a manual focus lens and converts it to autofocus. You focus your lens at infinity, and the TC has elements that handle the focus, and to the body it looks like you have an AF lens attached. There are quite a few issues though: the 1.6x magnification factor, given it's a TC the last camera the TC-16A works without modification on is the D200. If you don't mind some DIY you can switch the pins so that it will work on a D700. The TC-16A only works with AI and AI-modified lenses, so you'll have to find an AI compatible adapter for your lenses. and finally, there is still no guarantee you'll be able to focus at infinity. Quite possibly you will lose close focusing ability, and possibly not be able to focus at infinity either! Another possibility if you are into DIY is removing the mounting ring from your lens(es) and substituting a thinner reverse lens adapter. See this thread on photo.net: Mounting Minolta lens on Nikon"}
{"doc_id": 11251604, "author": "", "text": "There is an option for this, but unfortunately you cannot set it; it must be set by your friends who do not want to see your comments and likes. If you comment on or like a post that they can view, then your comment or like may appear in their News Feed unless they turn those off. To do that they can hover their pointer over your name or go to your profile/timeline, then move to the Subscribed button, and uncheck \"Comments and Likes\". Of course, they will still see your comments and likes on posts that they would see anyway in their News Feed, just not a separate story about them."}
{"doc_id": 239470, "author": "", "text": "According to the Wikipedia article comparing all Canon EF-S 18-55mm version the STM version has (in addition to the new STM motor) a new optical design (13 elements in 11 groups vs. 11 elements in 9 groups), internal focusing and an extra diaphragm blade (7 vs. 6) So, the EF-S 18-55mm IS STM is not just the EF-S 18-55mm IS II with the new motor but a completely new lens that seams to be slightly better than the old design in every way. Even if you don't need the advantage of the STM motor for video I see no reason to buy the older version (unless it's cheaper), I also don't see a compelling reason to upgrade for someone that already has the IS II but the new STM version is better. BTW, you can usually buy seconds hand kit lenses for next to nothing because a lot of people want to get rid of them when they upgrade, a quick look on eBay shows that the EF-S 18-55mm IS II has been sold for as little as $40"}
{"doc_id": 212670, "author": "", "text": "Higher ISO film tended to have more grain; and higher ISO digital shots exhibit more noise - a similar cause, but the visual appearance is different. Digital ISO noise is related to the size of each pixel, as the noise is per-pixel (so the more pixels you have, the less obvious noise is when viewed the same size), whereas with film, the noise is per crystal - you need larger crystals for higher sensitivity. One analogy I've used in the past to demonstrate this is to ask several people to time with a stopwatch how long it takes a car to drive around a car park, and then to time how long a person takes to do the same journey - because the person is slower, the margin of error is a smaller in proportion to the overall figure, even though different people will give timings to within a few seconds of each other."}
{"doc_id": 214082, "author": "", "text": "In addition to the answer above, both variants of the 50mm prime lenses (Canon & Nikon mounts) offer a huge bang for the buck. Either lens (in the f/1.8 variety) can be had for under $100, or so. I wish I still had the pictures (I do -- I just have no idea where,) but I did a direct comparison at 50mm between my Canon 24-70 f/2.8 L (~$1,200 is what I think I paid some time ago,) and my Canon 50mm f/1.8 prime (I bought this for $50 off of a for-sale board.) If I recall correctly, the 50mm f/1.8 beat the 24-70 f/2.8L out at 50mm up to f/5.6. So, with that said, if you like to shoot at 50mm (or 80mm on a 1.6x crop, etc.,) then it's a no brainer :) Good luck! Ian"}
{"doc_id": 11270552, "author": "", "text": "This is possible for google sheets without an applet like in the other answer. You can only set up notifications for yourself. You won’t get notifications when you make changes on your spreadsheet, but you’ll get notifications when others make changes. On your computer, open a spreadsheet in Google Sheets. At the top, click Tools ￼> Notification rules. In the window that appears, select \"when\" you want to receive notifications. Notify you when: Any changes are made: Set notifications when someone makes a change to a spreadsheet. A user submits a form: Set notifications when someone fills out a form. In the window that appears, select \"how often\" you want to receive notifications. Notify you with: Email - daily digest: Send a daily summary of all changes. Email - right away: Send an email for every change. Click Save. Source - https://support.google.com/docs/answer/91588"}
{"doc_id": 220824, "author": "", "text": "You are not losing any quality. It is mostly a habit, I am guessing. Lots of books on digital imaging still suggest TIFF as the highest quality format. For non-technical people, that is all they need to know. Note both TIFF and PNG have higher bit-depths as well. Most people who still save in TIFF use 16-bits per-pixel, so the equivalent of PNG-48. If they save as PNG-24 in this case, they do lose quality."}
{"doc_id": 11251624, "author": "", "text": "There could be no privacy setting that could help you - when we \"like\" something, we are actively making a public statement about something. If we don't want people to know we like something, we don't publish it on the web (i.e. don't touch that \"like\" button). Otherwise mark4o has the best answer: if your friends don't want to receive news about your \"likes\" then have to follow his instructions."}
{"doc_id": 227891, "author": "", "text": "Simple answer -- Physics. The number of lens elements (few), and relatively simple design of each lens element required to make a 50mm lens (for a 35mm format) contributes directly to the price. Where it takes many, very large glass elements to create a telephoto wide aperture prime, or a retrofocus design for a ultra-wide lens, the 50mm is right in the sweet spot of focal-plane to mount limitations. I'll let someone with more lens design expertise show you the math."}
{"doc_id": 11267693, "author": "", "text": "'Active Now' with green dot means person is online and visible to their Messenger contacts. Refresh the Messenger, if you still see 'Active Now' without green dot that means they might have their chat turned off or you have turned off your chat. Learn more about messages on Facebook. For Messenger app or messenger.com, visit the Messenger Help Center."}
{"doc_id": 232525, "author": "", "text": "The zoom-in and zoom-out buttons activate the manual-focus assist function. This lets you see pixels closer so that you can see better when focusing. This only applies because you are using Live-View which should be the exception when using a DSLR. In normal operation, through the viewfinder, these buttons will not do anything."}
{"doc_id": 238912, "author": "", "text": "This is based on a misunderstanding. Loss of quality happens only during the compression that is done when an image is saved as JPEG. But it doesn't matter whether it was edited or not. So: you will (with some very specific exceptions, see comments) lose quality if you open an image in an image editor and re-save it, even if you didn't make any edits. But if you only open it to display it and then close it instead of saving, then nothing will change. By the way: this is only for traditional image editing programs like Photoshop. Programs like Lightroom that \"develop\" RAW files follow a different approach (even when handling JPEG files): they always keep the original image intact and separately save the editing steps that were done, which are applied when exporting the final results. So with such programs, you don't have to worry about losing quality (more than once, that is). But then, you shouldn't be using JPEG source files for them anyway."}
{"doc_id": 248937, "author": "", "text": "The real worry is that the vendor appears to be kind and sweet, answers all your queries, and even appears to negotiate price. But after you have made an irreversible payment, a package arrives that either appears from the outside to be genuine (re-used packaging), or, worse, has a Customs declaration that totally misrepresents the shipped goods. Then when you complain, the vendor has disappeared. Like you, I ordered a Canon camera and lens for what seemed a bargain price, and received a couple of fake watches. When I telephoned the vendor, I got an oral apology that the firm was in liquidation, and that no compensation was possible. My only 'compensation' is to bad-mouth the vendor association which is in a country claiming to own the Pacific Ocean. You guess who."}
{"doc_id": 223625, "author": "", "text": "The two generally control two different aspects of the image projected by the lens. Focusing sometimes has the effect of changing \"zoom\" a little as well, however its purpose is different. To keep it simple: Focus adjusts the Focal Plane The focal plane is the thin plane of reality that is focused clearly on the imaging medium Focusing moves this plane nearer or farther from the camera's sensor/film Zoom adjusts the Angle of View The angle of view is the breadth of the scene projected by the lens Wide-angle lenses tend to capture very broad scenes (large angle of view) Telephoto lenses tend to capture very narrow scenes (small angle of view) Focusing in the past used to be achieved by moving the lens itself (i.e. in a large-format view camera) forward or backward (away/towards the imaging medium). This often results in changes to the angle of view as well, since the total focal length of the lens can change via extension...sometimes by a lot. In modern camera lenses, focusing may be achieved similarly...many cheap lenses focus by moving the front or back (or both) lens elements. Higher quality lenses tend to use an internal floating focus group, an internal group of lens elements who's sole purpose is to focus the image. The benefit of internal focusing groups is that the physical length of the lens stays the same, allowing you to minimize the amount of \"zoom shift\" that might occur when focusing."}
{"doc_id": 235115, "author": "", "text": "You commented that you cannot focus automatically on your kit lens. There should be a switch on the lens which you can use either for Auto or Manual focus - marked A and M. Set this to A for auto-focus. On the auto dial, set your camera to Auto mode and check auto-focus. If you are using the camera in other modes (as per the command dial) such as Aperture or Manual, there is an option inside the camera also to switch between Auto-focusing and Manual-focusing. You will also be able to select the focus mode and focus-points by pressing the \"i\" button on the camera and changing the options available on the LCD screen. The best way to know/learn this is to go through the camera manual which provides these instructions along with illustrations. If you are still not able to auto-focus after setting all these options, then you need to take the camera back to the shop or service-center for getting it checked."}
{"doc_id": 11257182, "author": "", "text": "So it turns out that the answer was right under my nose and does not involve any deceit or hacking. Yahoo! provides an option for creating an account without a cellphone, but it isn't via the \"Create Account\" button. On the sign-in page, there are a few options: If you click the \"Facebook\" or \"Google\" button, you can sign in to Yahoo! using a Facebook or Google account. Once you sign in that way, Yahoo! creates a Yahoo! account linked to your other account, and you do not need to enter a cell phone number to create a Yahoo! account this way. So for someone who wants to create a Yahoo! account without a cell phone, the steps are Create a Google or Facebook account. Sign into Yahoo! using the Google or Facebook account. Use that sign-in to create the Yahoo! account you want. To use this method, however, you give Yahoo the right to capture any & all information that is on your Facebook page. Be aware of this before making the connection to Facebook!"}
{"doc_id": 238911, "author": "", "text": "Absolutely not. You need to edit the file and re-save it as a JPEG in order to compound the effects of image compression. Just viewing it has no effect at all — if it did, all of the JPEGs on the web would \"wear out\" completely in a day or two at most."}
{"doc_id": 11251599, "author": "", "text": "The privacy of your like is dependent on the privacy of your friend's post. if they only share the post with you, then you liking it will only appear in your friend's activity feed/newsfeed. If they share it with a group of friends it will appear only in that group of friends' activity feed/newsfeed. If they share it publicly. It will end up in all your friend's activity feed/news feed"}
{"doc_id": 11260909, "author": "", "text": "I have had a couple friends deactivate their accounts temporarily. In each instance, I was not able to see them in my friends list anymore, and their comments to my posts disappeared as well. If you deactivate your account, you will not appear in anyone's friends list, and no one will be able to find you. They have to be able to find you in order to block you, so no one will be able to block you while your account is deactivated."}
{"doc_id": 11261330, "author": "", "text": "It's not possible to create a new Yahoo account without listing a cell phone number. You could make up a cell phone number but when you enter the number Yahoo is going to send a text message to that number so that you can verify that the number actually belongs to you. If you can't verify the number you can't activate the account. Other options would be asking a friend if you can use their cell phone number or buying a cheap prepaid cell phone. Remember if you use your friends number you still have to verify the cell number is correct and if you have an security issues like suspicious activity or forgetting your password Yahoo will send alerts to their cell phone."}
{"doc_id": 232065, "author": "", "text": "It's all about the lens. Looking at the cameras which are called a bridge camera, the first thing you will notice is the big honking lens on the thing, I think the rest of the features can be compared with point and shoots but not this one. That's its most distinguishing feature whether or not it makes it compare to an SLR is a matter of opinion."}
{"doc_id": 233253, "author": "", "text": "Inversely linear is a good approximation. Imagine a 1,7m tall girl at 1 m distance b. Her head is at point B. How does the size/length of an object vary with distance? Let the girl walk away from you. Her size a stays the same. She appears smaller, because she is appearing under a smaller angle. Her angular size changes. Try to imagine it with the picture attached. Using arctangent to calculate her angular size is the correct way. For small angles you can simplify: Angular size is inversely proportional to its object distance, without using optical devices. An object on full-field with focal length of 12 mm would be measured incorrectly. An error 2-5% in length measurement may be made. For fish-eye lenses this may be even worse. Hands-on rule: Use the inverse relationship if angular size is smaller than 10°."}
{"doc_id": 223796, "author": "", "text": "I actually had to do a quick google on \"bridge camera\" - but I'd say the differences are rather obvious: Bridge Camera = high end point and shoot better optics than a compact camera larger sensor than a compact camera DSLR: bigger sensor exchangeable lenses (key) optical viewfinder where you look through the lens (via a mirror -> SLR = Single Lens Reflex) (key)"}
{"doc_id": 212665, "author": "", "text": "The size of the grains in the film varies depending on the film sensitivity. The more sensitive the film, the larger the grains. Digital noise is always the size of a pixel, regardless of the ISO setting. Film grain is color neutral, as it consist mostly of luminance differences. Digital noise consists of both luminance and color differences, and is most visible in the blue color channel. In the more recent digital cameras the digital noise is quite even. In earlier models the noise had more banding and patterns. The film grain doesn't have any banding or patterns, so it's seen as pure noise. If the digital noise has any banding or pattern, the brain can easily pick that up, and that is more disturbing than pure noise. Neither grain nor noise eats detail. It's noise reduction that eats detail, as it can't tell the difference between small details and noise. Noise reduction is used on digital noise, but it can also be used to reduce film grain. There is an example below. On the left is the film grain from a Kodak Gold ISO 200 film. On the right is the digital noise of a Canon EOS 5D Mark II @ ISO 3200. Notice the blue noise in the dark areas in the right image."}
{"doc_id": 238916, "author": "", "text": "You definitely won't lose any quality just by viewing it. But, as pointed out above, you may lose image quality when saving it without making changes if the editor compresses it when it saves the file. For example, say you have a JPEG at no compression: You open it in The GIMP, make no changes, and save it The GIMP asks you how much compression you want (quality) You enter 90% quality (the default) Do this 20 times, and you'll see a significant decrease in quality, because it has been compressed 20 times. If you save it with no compression (100% quality), you'll see no change."}
{"doc_id": 239165, "author": "", "text": "Just opening and closing a JPEG file should not trigger a save command (in any program that I know of) and therefore there is no re-compression taking place. For the times that you actually DO hit \"save\", what happens depends on what changes you've made and how smart the image program in question is. The user CutNGlass has already mentioned an example of a smart image program, \"Better JPEG\", that takes advantage of the fact that JPEG images are made up of lots of independently encoded rectangular blocks of pixels, and only blocks that really NEED to are re-compressed when saving the image. For example, with such a program, you can remove red eyes and when the JPEG image is saved, only the blocks that were affected by the change are re-compressed. http://www.betterjpeg.com/features.htm Now, this technique to avoid having to re-compress any part of a JPEG image that does not need to be re-compressed is really \"old news\" (I'm no expert and I've known it for over a decade), so I guess I've taken it somewhat for granted that all the good image handling programs would handle this perfectly by now (which would mean that there would not normally be any re-compression from just opening a JPEG image and pressing \"save\", because the program would know that there has been no alteration to any blocks, and just leave them untouched), but from looking at this question and its varying answers, I can only gather that this STILL isn't true! *Maybe the programming behind such solutions is more complicated than I believe it to be - otherwise all JPEG-handling programs would have had this years ago!*"}
{"doc_id": 243089, "author": "", "text": "To understand the difference between a bridge camera and a DSLR, it is really necessary to understand the origin of the term \"bridge camera\". While a DSLR (digital single lens reflex) is a particular type of camera with a very well defined meaning (it uses a single lens which is used for both exposure and viewfinding), the term \"bridge\" simply means that it is bridging the gap between two different types of cameras. So, knowing that \"bridge\" camera is simply a marketing term, what was it that it was designed to be a bridge from and to? Traditionally there were two main types of cameras, your point and shoot cameras, which were designed to be small, simple to use, and basic for an average person to be able to take photographs. Historically, they typically had a fixed lens, a basic built in flash if any and a simple viewfinder that simply gave you an idea of what the lens would capture when you exposed the image. If present at all, settings like shutter speed were minimal. On the other side, you had interchangeable lens cameras with full ability to adjust (either manually or automatically) settings like shutter speed, aperture, focal length, etc. These cameras were much more advanced, generally larger and generally more complicated to use, especially outside of using automatic settings. SLRs are one example of this type of camera. Early on, the differences were more pronounced, however as cameras advanced, both of these extremes moved more towards the center. Point and shoot cameras now often do allow basic exposure adjustments to be made and the automatic shooting capability of DSLRs have made them much simpler for a novice to use and get ok results, however some of the advantages and disadvantages have remained. Generally, point and shoots still are smaller and lighter and DSLRs have far greater versatility and generally better image quality due to larger sensors and better optics. So, knowing those two extremes, a bridge camera means that it is a camera which specializes on trying to provide the advantages of both DSLRs and point and shoot cameras with as few of the disadvantages as they can. They are also sometimes referred to as hybrid cameras. Typically, they are larger than basic point and shoots and have lenses that have adjustable focal length, but they are typically not removable lenses. They generally use an electronic view finder to avoid the complexity of SLR optics. They generally have smaller sensors than a DSLR, but often larger than a typical point and shoot, so they split the difference in size and versatility without having all of the cost or complexity of a DSLR, but also with more versatility than a basic point and shoot. The exact differences will depend on the particular models you are comparing and some high end bridge cameras may actually perform better than cheap DSLRs in some situations, but the general idea is simply that they straddle the gap left between the design goals of a point and shoot and those of a DSLR. Perhaps the most consistent distinction in terms of what is being bridged is that of the level of control the camera gives the user. Ultimately, simple cameras tend to have simpler and more limited controls while high end cameras give the user direct control of every aspect of image capture. Bridge cameras sit in between the extremes of super simple with no control and complete control over every aspect of image creation. A more recent introduction to the space is mirrorless cameras which could arguably be considered a type of bridge camera, at least on the lower end (though they aren't typically called as such) as well since they feature generally smaller sensors and simplified bodies from those of DSLRs, but include interchangeable lens systems to improve versatility and quality over that of a bridge camera with a permanently installed lens. I would say that higher end mirrorless cameras could not be considered bridge as they have strong support for full lighting, exposure and lens selection control and are no longer really a bridge between almost no control and full control, but rather provide full control. So to break down the gamut of cameras, from simplest to most complex, you have the following: Point and Shoot / Compact - smallest size, most basic adjustments, cheapest, easiest to use Conventional Bridge/Hybrid - slightly larger, generally more adjustments, but often menu driven, zoom lens, but permanently attached, still very easy to use Mirrorless - still a small size. Camera body nearly resembles a point and shoot, however lenses are interchangeable. More adjustment options available. Often full adjustment is available, but may still use menus for some settings, more complicated to use as you need to consider lens selection and possibly exposure adjustments DSLR - large size, generally better image quality, full adjustments directly available on higher end models, most complicated bodies and thus generally most expensive, similar shooting complexity to mirrorless since full consideration of exposure, lens, lighting selections need to be considered That isn't a perfect list as there is cross over depending on how high end a particular model is, but it serves as a general guideline. Ultimately, when you are considering which camera to buy, you should look at the capabilities of the camera and your needs rather than considering if it is labeled as a \"bridge\" camera. Look for a camera that can get the shots you want and let you adjust what you want while taking care of the rest for you."}
{"doc_id": 11255629, "author": "", "text": "Google Docs does not make a good wiki. Optimized for printed page, not viewing online (page margins, document margins) Always in edit mode No mechanism to dynamically embed content or especially lists of documents in another document No friendly URLs for documents Does not link documents nearly as easy as in a wiki (requires interaction with menus/mouse and copying full URLs to documents) Does not support text zooming fully (appears to work, but try it, hit CTRL-+ and some document components often don't display properly. Basic documents work fine.) No cross-document consistent styling"}
{"doc_id": 227896, "author": "", "text": "Different simple answer: non-recurring engineering costs. The Nikon and Canon 50mm F1.4 lenses are old. The engineering was paid for years ago. Plus, these lenses have sold in huge numbers, so the economies of scale work in your favor. As you suggested: years and years to optimize. The engineering costs are paid for, the manufacturing line is optimized."}
{"doc_id": 11266544, "author": "", "text": "You can create (or, more specifically, I was just able to create) a Yahoo account without a mobile number by signing up with an existing email address. On the sign up page, click on \"I'd rather use my own email address.\" Now, of course, you need another email address that itself doesnt require a mobile number. There aren't many. On 7/29/2016 I created one successfully with gmx.com which does not require a mobile number. (I suppose if you just want some email address, not specifically Yahoo, you could just create a gmx.com (or other) account and stop there.) The from address from this Yahoo account created this way looks like this: 2jcmsbudasxshcg2f3vo**********7zopdpg3zm@yahoo.com You can \"neaten\" up this address by creating an \"extra address\" : https://help.yahoo.com/kb/account/create-extra-email-address-sln3290.html Briefly the steps are: Gear -> Settings -> Accounts -> click your account name -> Extra email address...Create address None of these steps currently required me to provide a mobile number. However I suspect they're always trying to close such loopholes. This experience is from July 2016. Note that the mobile number is an effective password recovery mechanism should you forget your password, or if it's hacked, and you don't have one using this method. However, your gmx.com email will serve for that purpose here too. You may need to log into your gmx.com account every few months to make sure it doesnt get deleted for inactivity."}
{"doc_id": 238942, "author": "", "text": "Simply put No. To be specific. When saving the JPEG image you have some losses as JPEG is defined as lossy compression. The image is compressed using Huffman coding if I am not mistaken. Now when an image editor opens up an image it does not decompress the image. It simply decodes the compressed image so the screen can show what is in it. But when you make changes and re-save it the image is recompressed to a new jpeg with more data loss. Software like GIMP ask you how much quality you want though so you can choose 100% to keep the existing quality. Now opening and closing an image without making any changes would never matter on how it's stored and what data is lost. Opening it for viewing and then closing does not make any changes to the file. No matter what the case (mp3, image, word document). Since nothing is saved the quality will always remain the same. But as previous answers have said, if you are really worried about data loss you can simply use other formats like png or tiff."}
{"doc_id": 11272170, "author": "", "text": "There are many solutions and it all depends how you manage your information. The concept of wiki itself means quick. Quick answers, ease of access to information: Use Google Docs with headings and document maps. Add combination of bit.ly or url shorteners maybe keeping an organized table in Google Sheets of the hyperlinks. use Ctrl + K to insert links in a human readable form. Use Google sites and build stuff by using HTML Use third party apps such as Gwki(Gwiki had disabled the Google login), Zoho Wiki Use a Google product to have a map (key | value) table like structure. You can have things such as categories > table with information > sub tables > sub categories > tables > sub-tables."}
{"doc_id": 223797, "author": "", "text": "The main thing about a Bridge camera is that it's \"Bridging\" the gap between a small point & shoot camera, and a larger DSLR. So the comparison of a bridge camera to a DSLR comes down, basically, to the following:- A larger optical zoom lens like a DSLR. Versatile, but not interchangeable. The sensor is generally not as advanced as a dedicated DSLR, and therefore Bridge cameras tend not to handle low light/high ISO situations as well as a DSLR (but better than a P&S). You won't get an optical viewfinder on a Bridge camera. It will be either an LCD display only or an EVF-Electronic Viewfinder (which mean when you look into the viewfinder eyehole you see the image of what the lens is seeing, as captured by the sensor, rather than the true image as reflected by a mirror). Of course, by its very definition, an SLR will have an optical viewfinder. A Bridge camera will generally have similar controls and handling to a DSLR, and be complete with Program, Aperture Priority, Shutter Speed Priority and Manual exposure programs, just as you would get on a DSLR and high-end compacts. You are usually able to shoot in RAW just like on DSLR's and high-end compacts. A good article on Bridge cameras can be found here. From personal experience, my old Boss once asked me about some issues he was having with his Fujifilm Bridge camera. Indoor photos of his daughter, when viewed at 100% had absolutely horrible red marks all over the photo - especially in the skin tones. So much so that even viewing at a reasonable smaller size on the monitor resulted in noticable red 'grain' in the photo. I took the camera and tried lots of things with it, but was unable to correct the fault. He asked me for a recommendation and (at that time) I suggested the Canon Powershot S90. He got one, and never had any problems with the photos from it. So if you are considering a Bridge camera - it may be worth instead to look at a high-end compact instead. As an aside I once heard it said that with Bridge cameras you essentially get the disadvantages of both systems -- the size and weight of a DSLR and the lack of flexibility of a point & shoot. I quite like the saying, but it's an individual viewpoint. Many people have Bridge cameras and are very happy with them."}
{"doc_id": 223624, "author": "", "text": "Focusing is just changing the plane of focus, so at a very fundamental level, all that is happening is the lens elements are moved as a single group towards or away from the sensor (though in practice there can be minor changes in the separation of the groups to counter unwanted optical effects). When you zoom, the element groups in a lens will move independently of each other, with the spacing increasing or decreasing between the various groups to change the path the light takes through the lens."}
{"doc_id": 11247161, "author": "", "text": "Yes. But you have to manually keep track of the URLs to the documents. And you have to setup manually the edit permissions per document as well. Consider using sites.google.com."}
{"doc_id": 233249, "author": "", "text": "The relationship is a simple inverse, i.e. object size in image = Object size * focal length / object distance from camera If you keep the same object and the same focal length you get: size = 1/ distance (the =-sign should be proportional-sign)."}
{"doc_id": 238914, "author": "", "text": "Definitely, like any file, if you don't hit \"save\" but just close the file, no changes will be made. (think of it like a word Doc that you just open and close) If you do make changes, most programs will give you a notification asking if you want to \"save changes\" So the answer is definitely no to your question. Hope that helps."}
{"doc_id": 213086, "author": "", "text": "Sigma lenses can offer excellent value, but it does depend which model you go for. I have a Canon 5D Mark II, which has a full-frame sensor, and I use two Sigma lenses with it: A 50mm EX-DG Macro and a 105mm EX-DG Macro; both of these produce excellent, sharp pictures. The only downside to these lenses is lack of USM focusing, but this isn't an issue in most cases, especially when doing macro work as I'd focus manually anyway. Their 100-300mm f/4 is another lens I used which was also very good, though not quite so cheap. On the other side, the 20-40mm zoom I bought from them was a dud, and didn't last long before being replaced with a Canon 16-35mm f/2.8 L II. Not cheap by any stretch of the imagination. Conclusion: it appears to be hit and miss with Sigma lenses; there are some great ones, and also some that don't deserve a second look. Check fredmiranda.com for comprehensive reviews by users."}
{"doc_id": 232237, "author": "", "text": "The main issue with any \"how weather sealed is my Canon DSLR\" question, is that they are not rated to a depth of waterproofing. And how else would one measure this? \"The Canon 50D can withstand the rain of 1/4\" per hour coming perfectly vertical with XYZ lens\"? Canon does not provide this information, and the information you will find on the internet will vary depending on each personal experience. As Itai noted, it does have some sealing, which is in effect some foam material and some rubber seals. To get better sealing add a \"L\" series Canon lens with weather sealing, and potentially a filter to seal the front of the lens if the lens needs that. Beyond that information, it is pure conjecture how good the sealing will be in the specific environment you shoot in. Do you need weather sealing? Then check out Pentax or higher end Canon DSLRs. Is it raining/snowing? Protect your camera unless you don't mind the potential for failure."}
{"doc_id": 11248899, "author": "", "text": "Apart from the two answers already given... I recommend simply giving a link to the original host of the EXE file, if it exists: you don't have to upload the file and if it gets shared again everyone will save on upload bandwidth and time. Makes it easier and faster for both ends if the file is already hosted somewhere. Or, in case it's an original EXE that you've created, either get your own host or use a 3rd party service such as Dropbox or CloudApp. It will even look more professional, as it probably should be. A last option would be using Google Docs. Hopefully this will get integrated with gmail someday."}
{"doc_id": 218511, "author": "", "text": "One thing that is great with Sigma lenses is their after market service. You can get a free check up of your lens every year, as long as you keep the black card that was in the original package."}
{"doc_id": 11273695, "author": "", "text": "https://youneedawiki.com/ looks awesome, however to me what makes a wiki useful is the search functionality which is lacking from the free version, and only 1 user. That's as their model pushed users towards the paid version. https://www.zoho.com/wiki/?src=zoho-home seems to do the trick for me (search + 3 users) in the free version. Both allow you to import your existing G-Drive docs."}
{"doc_id": 223627, "author": "", "text": "At a basic level, focus adjusts how far from the camera a subject will be sharp (in focus). Zoom adjusts the magnification (angle of view mapped to the same size picture). The two are totally different. While differnt, on some lenses adjusting one may have a effect on the other. In particular, lenses that focus by sliding in and out actually change their magnification ratios in the process a bit too. This can matter in some cases, particularly for very close subjects. For ordinary non-macro shots from landscapes down to portraits or so, you'd have to look hard to notice this. The zoom adjustment will have a much greater and obvious effect than the small zoom side effect of focusing. Some \"internal focus\" lenses have less zoom side effect as a result of focus changes."}
{"doc_id": 11272781, "author": "", "text": "Disclaimer I have not yet used this tool This tool looks promising: https://youneedawiki.com/ It allows you to create a wiki that is backed by Google Docs."}
{"doc_id": 239174, "author": "", "text": "Olympus has a video explaining it. They show all axis with each one designed to compensate for a type of movement. It is an evolution of sensor-shift stabilization: Originally, when Konica-Minolta invented Sensor-Shift stabilization, the sensor moved along two axis, vertical and horizontal. This compensates for the camera moving along a plane as long at it remains level and does not alter orientation. Pentax then implemented their own Shake-Reduction system using sensor movement. They used the same basic design and introduced rotation which compensate for movement in the tilt-axis. This improves camera movement correction because when the shutter-release is pressed, the camera tends to tilt which is not compensated for with the original 2 axis. Olympus then created the 5-axis stabilization system that lets the sensor rotate along 2 more axis, corresponding to camera pitch and yaw. This makes it possible to compensate for even more type of movements and allows to stabilize images while the photographer is moving. These are 3 axis of rotation and 2 axis of translation. One could attempt to compensate for a third translation axis, I suppose, but the remaining one probably has less effect on image sharpness as focus is probably sufficiently sharp within a certain tolerance, while other type of movements do show as inconsistent sharpness."}
{"doc_id": 11265595, "author": "", "text": "Yes, Just go their channel, hit the about tab, send them a message and it tells you it has been sent and when you subscribed."}
{"doc_id": 220829, "author": "", "text": "You explicitly mentioned PNG-24 - that has eight bits per channel, whereas a TIFF file can have 16. That would be one reason the quality could be higher, from a RAW conversion especially but also if you are doing a lot of editing. The PNG standard also supports 16-bits per channel (PNG-48) but I don't know how many applications support that, whereas pretty much anything that can read TIFF is going to be able to read a 16-bit TIFF file. TIFF can also store layers in it, which is not a quality issue so much as a flexibility thing. PNG is really meant to hold an image, not a layered set (although APNG can hold a set, it's really not for the same purpose). One additional bit of practical information is that TIFF can store many kinds of Photoshop layers, I have used it for images which had a number of adjustment layers applied. That is not possible with PNG, you would have to flatten the whole image."}
{"doc_id": 214090, "author": "", "text": "I have a 50mm 1.8 (which unfortunately won't auto-focus for you) and the 35mm 1.8 DX. As mentioned above, the 50mm is really great for portraits - the crop factor with the 50mm gives lovely focus and crispness. I just recently bought the 35mm 1.8 DX lens from B&H and it too is quite good - great in lower light situations and fairly small (in size) so it doesn't add much weight to your camera. I paid about $190 for it, which is great considering how good these 'cheap' prime lenses actually are (as mentioned by Ian P above). For low-light close up photos i don't think you'll be disappointed with it."}
{"doc_id": 11269062, "author": "", "text": "I know this is way old, but I've wanted this functionality for a really long time, so I finally built a little wiki viewer for Google Docs. Check out an example at https://gwiki.kaelshipman.me, and the source code on GitHub: https://github.com/kael-shipman/libgwiki. All it does is use Google's Drive API to fetch a document hierarchy from a \"home\" folder that you feed it. Then it builds a little UI around that hierarchy that provides a \"main menu\" at the top (for all direct children of the home folder) and a nested sub-menu on the side as you descend into the hierarchy. (Note that the example asks for permission to view your google drive docs (for obvious reasons). If you're not comfortable with that, you can always just download the repo and set it up yourself, though you'll have to create a Google API key and client credentials.)"}
{"doc_id": 212666, "author": "", "text": "There's also the issue of chroma (color) vs. luma (brightness) digital noise. People generally find chroma noise more objectionable because it appears less natural; this is why noisy photographs sometimes work better in a B&W conversion. The better noise reduction algorithms can also address one or the other selectively. I believe that film has pretty much only luma noise, which is one reason people sometimes find it less objectionable than digital noise."}
{"doc_id": 212134, "author": "", "text": "Sigma makes some great lenses, and Sigma makes some lenses that are of pretty poor quality. Canon is the same way... it's hard to make a brand-wide generalization. A much better option is to do research based on specific lenses. I've found the lens reviews at FredMiranda.com to be pretty helpful."}
{"doc_id": 235074, "author": "", "text": "Any G lens is a D lens. Not all D lenses are G lenses. The difference is that a G lens lacks an aperture ring for manually setting the aperture on the lens (rather than the camera). This isn't very important on modern cameras (everything producedin the last 20 years or so) except sometimes in full manual mode it can be more convenient than using the camera controls. The reason he advised that lens is not that it's a D rather than a G lens, but because its far wider maximum aperture makes it much more capable in low light situations than the lens you already have (it can capture a lot more light, meaning shorter exposure times). It's also optically far superior to your kit lens, giving better photos with less distortion and lens artifacts. Neither is related to D vs. G, it's just differences in the design and materials used in the lens construction. The main reason to omit an aperture ring on many current lenses is cost (it's extra construction, materials, etc.), and there being no space for one on a lens that has VR (the number of contacts on the electronic linking between the lens and body means Nikon could not design a lens that has both VR and an aperture ring without changing their lens mount, which would break compatibility between new and existing lenses and bodies, which they've always avoided)."}
{"doc_id": 248898, "author": "", "text": "A common \"scam\" is to offer the camera body for a very low price, and then make up the difference by charging high prices for everything else. You say the offer is for \"5D III + 24-105 L lens for 1100€\" -- this is exactly what you'll get. It doesn't include a battery, or the user manual, or the camera strap, or lens caps, or a protective cover for the hotshoe, or anything else you'd expect in the box. The seller will make these available, but at huge markups. Additionally, if you don't opt to buy the overpriced accessories, expect it to take months for your order to ship, if it ever does, as they \"don't have it in stock, but it'll be arriving from our supplier any day now\", or \"we're having a dispute with the shipping company, rest assured that we value your order\", or other delaying tactics."}
{"doc_id": 255495, "author": "", "text": "From Lexar Website: \"SDXC is an SD memory card format that is based on the SDA 3.0 specification. SD and SDHC cards are based on the SDA 2.0 specification. SDXC memory cards use the newer “exFAT” file system that is more efficient for SDXC’s large capacities, while SD and SDHC memory cards use the FAT32 file system. This difference is the reason that the new SDXC format is NOT backwards compatible with host devices that only take SD (128MB to 2GB) or SDHC (4GB to 32GB) cards.\""}
{"doc_id": 223798, "author": "", "text": "It's important to realize that \"bridge camera\" is not a technical term. It's a marketing term *, made up to sell more-expensive cameras to intermediate photographers who are beyond point and shoots but are intimidated by the cost or complexity of a SLR. Generally, the things sold as bridge cameras are bulky point and shoots which kind of look like they might be an SLR. Usually, they have superzoom lenses built-in. Somewhat ironically (or maybe just unfortunately), this isn't what someone needs if they really wants a \"bridge\" to go from naïve to knowledgeable photography. There's a little more on this in the answers to this question Is there any bridge camera with an interchangeable lens? (To which the answer is: by definition, no.) I think this term really should be obsolete in this decade, as the market has many great actual intermediate cameras that are definitely not point-and-shoot in the sense of no control or advanced functionality. The new Canon G1 X, which has a large (basically micro-4/3rds sized) sensor but a non-interchangeable zoom lens is a poster-child for this, but also pretty much all the lower-range mirrorless interchangeable lens cameras too. Basically, there's a whole bunch of advanced cameras which are not DSLRs but also beyond point and shoot. One could apply the term \"bridge\" to all of these, but I don't think it's very useful. I recommend ignoring this term and talking about specific cameras (or groups of cameras — all the small-sensor superzooms are basically identical) or specific features (like a large sensor in a compact camera body). * See newspaper article from 1998 about the \"new\" type of camera."}
{"doc_id": 11268452, "author": "", "text": "Click the update info button of whatever information you wish to update and hit edit. Click the privacy setting button next to the specific item you will change, and then change the setting to “Only Me.” Enter your new information, and then save it. Because you set the privacy setting to \"Only Me\" no one will see the information on their feed but can't see it on your timeline either. Click the Activity Log button near the top of your timeline Click the pencil button next to whatever update you just made and select \"Hidden from Timeline\" Return to your timeline and go back to the update info section and whatever new information you just updated, and change it's privacy setting back to it's original state. Because you have hidden the update on your own timeline, the update won't appear in your friends timeline either, but if they very specifically click on your page they will see the updated information. Waiting 24 hours does nothing other than moving that information further down peoples timelines and notifications. This method will make sure that it never appears on their timelines in the first place."}
{"doc_id": 232234, "author": "", "text": "The 50D is not officially weather-sealed but does have some protection so you can get by in light rain or snow but I would not take it in rougher conditions."}
{"doc_id": 11265486, "author": "", "text": "Go to your Instagram profile and click on Edit Profile. Enter the Email address you wish to use for login (and make sure you have access of this email), set a Username (you can use your username instead of email id with password to login your account). Now go to https://www.instagram.com and tap Forgot? next to Password on the log in screen to reset your password: To reset through your email address, tap Username or Email, enter your username or the email address you used to create your account and tap search. Choose Send a Password Reset Email. To reset through Facebook, tap Reset using Facebook. You may be asked to log into Facebook. You can then enter a new password for the Instagram account that was most recently linked to your Facebook account. Note: If you can't access the email you registered with and you didn't link your Instagram account to Facebook, we're not able to give you access to this account. After resetting your password you can disable you Facebook account or you can unlink your Facebook account from Instagram first and then disable your Facebook account."}
{"doc_id": 235091, "author": "", "text": "The Nikon D5100 camera body does not have an in-built focus motor. The G lenses are AF-S lenses which include a focus motor inside the lens - these lenses can be used with entry level camera bodies such as the D3100, D3200, D5xxx series. AF-S lenses also do not include an aperture ring and will not be compatible with older Film cameras. The D lenses are older lenses. These lenses would include an aperture ring and would be compatible with older Film cameras. Few D lenses are AF lenses which do not include an auto-focus motor inside the lens. If auto-focus is a requirement, these lenses require a camera, generally in the mid-to-high-pro-level body range which include a screw-drive focusing motor (auto-focus motor) inside the camera. These lenses will work on the entry level Nikon cameras but focusing will need to be done manually. Few of the D lenses range also have AF-S. These lenses will be able to auto-focus on the entry level Nikon cameras including the D5100. The 300mm f/4D AF-S is an example of this which is currently available. The D lenses are also somewhat cheaper compared to the G lenses. However, to use auto-focus on the D lenses with AF, you need to invest more on the higher level camera body - D7000 and above. If you are currently using the 50mm 1.8D on your D5100 camera, you are probably using manual focus for taking your photographs. List of Nikon F-mount lenses with integrated autofocus motor - Wiki Link - http://en.wikipedia.org/wiki/List_of_Nikon_compatible_lenses_with_integrated_autofocus-motor"}
{"doc_id": 215229, "author": "", "text": "I have the 35mm 1.8 and the 50mm 1.4 - and for people wanting thier 1st fixed prime I always point them at the 35mm 1.8 1st. Its cheap, light and will work on your D3000."}
{"doc_id": 248897, "author": "", "text": "Yes, there are counterfeit cameras. Last time I visited Beijing, I had my cam around my neck while visiting a mall known to sell both original and fake products. (Well, I did not buy anything or trust anyone there.) A seller immediately recognised my G16 and asked \"Nice cam! Original or buy here? How much?\" Well, while that anecdote doesn´t bear the authority usually wanted on the stackexchange network, at least it should ring some bells. As to the manufacturing prices: Sometimes fake manufacturers manage to get real cases (guess where they are made) and fill them with wortlesselectronics and optics."}
{"doc_id": 257470, "author": "", "text": "The unmixed powders, such as XTOL or D-76, in their original sealed packaging can be expected to last several years. However, with age does come increased risks of issues. If the powder remains as fine grains and pours smoothly, then that is a good sign that there were no issues in storage. If it is clumpy, has uneven texture or colours, then treat with very high suspicions. Powders you suspect are more than a few years old should likely be tested before use with rolls of film you deem important. Extremely important rolls should probably always be processed in chemistry you've very recently tested with less important rolls. Film and chemistry is cheap, once in a lifetime shots aren't. The older tins of developer are typically considered totally shelf stable if they're not damaged, and are potentially good for decades. The newer foil packets are apparently more prone to spoilage, and may quietly fail after only a few years with poor visual indication. Stock solution made from older powders can fail faster than normal due to being more oxidized than expected. In general it is good to avoid letting mixed stock solution sit too long, but aim to use up older chemistry sooner rather than later. In general it is good to treat all chemistry with some suspicion and care, and increase your suspicions as it ages."}
{"doc_id": 232740, "author": "", "text": "To zoom with those lenses on your D5200, you must physically move the zoom ring on the lenses. When you push buttons on the back of the camera to zoom in on a particular spot on the screen, you are just magnifying one area of the total image so you can see it better. You are not making any change in the lens' focal length. The camera will record the entire image striking the sensor, not just the part you have magnified at the time on the rear LCD. One reason you would want to zoom in on a particular area would be to manually focus more precisely. Many compact point-and-shoot cameras have digital zoom which maeans that the camera crops the image as it records it. Most DSLRs, including your D5200, do not use digital zoom in-camera. You can accomplish the same thing with pictures from your camera by cropping the full image using your computer."}
{"doc_id": 216500, "author": "", "text": "The 50mm is \"standard\" because it's a cheap lens to produce, and in the era of slow films, having a fast max aperture for little money was a good thing for most photographers. Many SLRs were sold with a 50/1.8 or 50/2 as a kit lens. When films became faster most consumers found a slower zoom lens to be more versatile. I believe Oskar Barnack, the creator of the small-format camera (the Leica) chose 50mm as a standard lens because even if it was longer than the theoretical standard of 43mm it was easier to produce a good 50mm using the technology of the time."}
{"doc_id": 11257950, "author": "", "text": "If you use an instant messaging client application, such as Trillian, Pidgin, Digsby etc., you can set them up to be able to chat over Facebook too, and those programs have settings that let you play a specific notification sound when a particular friend comes online."}
{"doc_id": 11272235, "author": "", "text": "From Facebook Help Center: When you delete a friend request, the person who sent you the request won't be notified and can't send you another request for one year. So, she has to wait for one year to send you a friend request. But you can send her friend request. If you are not seeing option to send her friend request then probably she has set the privacy. Ask her to change her privacy settings for adding friends. Instructions are given here: How do I change who can add me as a friend on Facebook? Other than privacy settings, there could be some other reasons also which is mentioned in this Facebook FAQ: Why can't I add someone as a friend on Facebook? If everything looks fine and still you are not able to send her friend request then this block is temporarily and you have to wait for few days or weeks. Facebook sometimes does this kind of blocking for security purpose."}
{"doc_id": 238924, "author": "", "text": "Simply put: Opening: no loss of quality Copying: no loss of quality Displaying: no loss of quality Saving without edits: is copying, no loss of quality* Saving with only metadata edits: no loss of quality* Saving with changes to compression quality: loss of quality Saving after image data edits: loss of quality *Dependant on program, poorly implemented programs may actually recompress even when not needed with the resultant quality loss Decoding any digital data is lossless. There is not a single digital format in which mere decoding and display would alter the data. It's only recompression of the image data that is potentially lossy. Certain editing operations that are actually just metadata edits should not cause any loss of quality, for example EXIF rotation is lossless."}
{"doc_id": 232238, "author": "", "text": "The main difference in cost probably comes from economies of scale. For a long time SD cards were more expensive, but now they've become cheaper as they've become easier to manufacture and require less materials. Meanwhile, due to their bulk, consumers have fallen out of favor with CF and prefer SD. Additionally, the architecture of the cards is different. For SD, the controller for reading the card resides in the reader and thus readers cost more but cards cost less (but are limited by the reader). For CF on the other hand, the controller resides in the card. This allows for some interesting things like the old Microdrives that were actual hard drives inside a CF card. There were also devices like wifi modems and barcode scanners built in to CF cards. Since the controller resides in the card however, it means extra expense in the production of the cards. The faster the card, the better the controller has to be and the bigger the cost difference to a comparable SD card. As far as which is better, it really depends on the two cards and the reader being used."}
{"doc_id": 235075, "author": "", "text": "Here is the description from Nikon's own web site: D-Type NIKKOR Lenses A D-type lens relays subject-to-camera-distance information to Nikon D-SLRs that feature 3D Color Matrix Metering (all versions), 3D Matrix Metering, 3D Multi-Sensor Balanced Fill-Flash and i-TTL Balanced Fill-Flash. Many D-Type lenses have an aperture control ring and can be used on older Nikon SLR cameras that allow for manual control of the aperture, as well as on D-SLRs—especially useful for adjusting aperture while recording D-Movies on higher end models. When used on a D-SLR, the aperture control ring needs to be locked at the smallest possible aperture (generally designated in orange), and the aperture control is maintained through the camera's command dial G-Type NIKKOR Lenses A G-type lens does not have an aperture control ring and are intended for use on Nikon D-SLRs that allow the lens aperture to be adjusted via the camera's command dial. Because G-type lenses relay subject-to-camera-distance information to the camera, where it is used to help determine ambient and flash exposure, they are also considered to be D-type lenses. The lack of an aperture control ring is perhaps the easiest way that you can tell if a lens is a G-Type NIKKOR or not. [The AF-S NIKKOR 24-120mm f/4G ED VR lens, shown above is an example of a G-Type lens. Note there is no aperture ring on that version of the lens, while there is an aperture ring on the AF version, above right.] http://www.nikonusa.com/en/Learn-And-Explore/Article/go35b5yp/which-nikkor-lens-type-is-right-for-your-d-slr.html To me the main different is that a G lenses are newer lenses where Nikon have removed the aperture ring."}
{"doc_id": 11251674, "author": "", "text": "You can change the email address on a Facebook Page by doing the following: Instructions if Timeline for Pages hasn't been implemented yet (The old look) Go to your page while logged into Facebook Click the Edit Page button in the upper right below the Facebook bar Click Basic Information At the bottom of the page edit the email field Click Save Changes Instructions if Timeline for Pages HAS been implemented for your page Go to your page You may have to click the Admin Panel button to the right of the cover photo Once the Admin Panel is open click the Edit Page button Click Update Info Click Basic Information At the bottom of the page edit the email field Click Save Changes"}
{"doc_id": 238926, "author": "", "text": "JPEG compression can be described as having two distinct phases: first a lossy phase, then a lossless phase. Understanding the difference between them is important to this question. This isn't so much because it helps understanding what's going on, but because it helps to understand where the common mistakes come from. Lossy compression happens only when the file is saved. This is the part that causes loss of quality. However, just closing the file is not enough to trigger lossy compression: you have to save it. Some editors may refuse to save JPEG files that haven't been edited, to avoid accidentally triggering lossless compression, but I don't know off the top of my head whether or not any editors actually do that. Lossless compression also happens only when the file is saved. The main difference is that even if it happened when the file was closed without saving, it wouldn't matter, because it's lossless. JPEG uses both techniques together. Lossless decompression happens whenever the file is opened, but not at any other time. Not when it's closed, and not even when it's saved. As with lossless decompression, it wouldn't matter even if it did happen during these times, because it's lossleess. \"Lossy decompression\" never happens. There's no such thing. There can't be, because the data that got thrown out during the lossy compression phase is gone. If you could somehow reconstruct it, then you'd have a lossless compression algorithm, not a lossy one. I'm only even mentioning the concept because, having mentioned two types of compression, it would look strange if I mentioned one only type of decompression without explaining why. Note that saving the file triggers both kinds of compression. There's not much of a way around this, unless you know that the image has not been edited, but then there isn't much point to saving it either. Note also that just closing the file without saving does not trigger either phase, not even the \"safe\" lossless compression. Because of this, just opening and closing the file cannot decrease image quality."}
{"doc_id": 11272836, "author": "", "text": "You can use an add-on like ezNotifications to enable this functionality for Google Docs."}
{"doc_id": 11256712, "author": "", "text": "Yes, they both belong to yahoo and can be used for chatting. They are just different domain names like while .co.uk is for UK and .com is just general. But its still yahoo, so u DEFINITELY can chat between them."}
{"doc_id": 248890, "author": "", "text": "I'm trying to figure out where the catch is. The camera might have been stolen. The camera might be broken or damaged in some way that's not immediately noticeable. For example, if the body casting itself is bent, the camera might not be able to take a sharp image, or the battery connection might not be reliable. Professional cameras like the 5D line are very tough, but they're not indestructible. What are some risks buying such a camera? In most places, receiving and/or possessing stolen goods is itself a crime. You could be stuck with a camera that can't be repaired, or one that costs more to buy and repair than it would have cost to buy a new one. If there are canon camera counterfeits around, how can I recognize them really quickly? I haven't heard of counterfeit cameras, and producing such a thing on a small scale would likely be more expensive than buying the real deal. Conversely, a counterfeit Canon 5D III that could be sold at a much lower price would have to be a pretty poor imitation. The best way to protect yourself in this case would be to become familiar with what the real thing looks and feels like and how it works. Counterfeit batteries, on the other hand, are a little harder to spot. There's an article on Canon's web site that explains how to spot fake batteries that are passed off as being Canon OEM batteries."}
{"doc_id": 212664, "author": "", "text": "The biggest difference is the patterns in the noise. Film grain is caused by the grains of silver present in the film, and are not in a consistent pattern. ISO noise is caused in the digital sensor and is pixel based, and therefore in a pattern. Some feel that film gran is more pleasing because of the inconsistent pattern in which the noise occurs."}
{"doc_id": 233250, "author": "", "text": "I'm sure this is a duplicate, but I can't find a good answer to the question in the archives so here goes. The relationship between object size and distance is an inverse linear relationship, i.e. size is 1 / distance. This makes sense when you think about it as if you double the distance the size halves. This is why you appear to be observing an exponential: the exponent is -1, if you take the reciprocal of the size, your graph should be a straight line."}
{"doc_id": 228859, "author": "", "text": "I don't know about your specific model, but many roll film cameras will not reset the exposure count until you open the film door (the back of the camera). That was pretty much universal among the 35mm SLRs and rangefinders I've owned over the years. The frame count is generally hooked up mechanically to the film advance mechanism, which is disengaged when the film is being rewound (the rewind button releases a toothed clutch on the take-up spool, disconnecting it from the film advance and shutter-cocking gear train). The \"S...\" is probably indicating that the start of the film (the tongue) hasn't been moved yet. You normally have to advance two frames before you actually get to usable film (since the tongue protrudes and will be exposed when loading). Try \"dry firing\" the camera without any film loaded. You should see the frame counter advancing as you shoot (provided that you aren't pressing the rewind button at the time). If that's working properly, the problem is either with the way you've loaded the film or with that particular roll of film (a mechanical problem within the canister)."}
{"doc_id": 215210, "author": "", "text": "Many photographers (especially those with full frame sensors or 35mm film cameras) opt for a 50mm prime lens because it is considered 'normal', i.e. not wide-angle or telephoto. Because these lenses are so popular, they are also produced on a relatively large scale, which also makes them cheaper than other lenses of the same speed. With that said, there is probably a deeper underlying question to be answered: Why is a 50mm lens considered 'normal'? There are actually a few factors that contribute to this. If we look at a single human eye from a mathematical perspective (pun not initially intended), the focal length comes out to be around 17.2mm. [as a side note, its aperture is around f/2.1]. Our eye is, indeed, a wide angle lens. Now, the eye's sensor size (the retina) is smaller than the 35mm film sensor that the '50mm normal' is based on. This will make the equivalent focal length of the eye longer, but not by enough to get it to 50mm, there is another factor at play... The images that we take with our 50mm 'normal' lens are generally displayed on a screen, or printed (or developed) and displayed on a wall or in an album. Very rarely do we ever get so close to an image that it takes up our full Field Of View (if we did that, we would not consider the image we saw as 'normal' anymore). We generally hold a photo at a distance that makes it look 'normal' (optimally, at a distance equal its diagonal). Because the image only takes up a portion of our FOV when viewed this way, we are adding an additional crop factor, making the equivalent focal length even longer. Only when we consider all these factors do we come up with a 'normal' focal length value of about 50mm. And remember, that value is only when the image is projected onto a 35mm sensor! for other camera types you need to multiply the magic 50 by your sensor's crop factor to get the 'normal' focal length for your camera. Refs: http://www.photosig.com/articles/585/article"}
{"doc_id": 257469, "author": "", "text": "This is almost purely anecdotal, but... I recently (3/2019) bought a bag of XTOL which has the following markings: © 2016 Kodak Alaris Inc. EXP: 2021-05 From this I gather that Kodak gives a shelf life of 2–5 years for unmixed, unopened XTOL. (Not sure whether the copyright statement indicates year of manufacture or something else.) However, word on the Internet is that you may expect much longer lives from powders that have been properly stored. Cans/jars are reputed to be less porous than bags, leading to increased shelf life. In practical terms, I'd Open the bags/cans and inspect the contents; if the powder is white (not brown) and dry, proceed to next step. Mix it up and develop a test film. Only proceed to develop important stuff once you're satisfied that the developer still works."}
{"doc_id": 11270172, "author": "", "text": "Go to messenger settings in notifications and sounds there is a setting \"light\" if it's slid to the right and the circle is blue it's on. Just click it to run it off."}
{"doc_id": 11268881, "author": "", "text": "According to @SlackHQ (the official Slack twitter account), \"owners can only see the private channels that they are a member of\"."}
{"doc_id": 218513, "author": "", "text": "I've had a lot of Sigma lenses in recent years and all have been pretty damn good. The 12-24 EX is a great lens and about as wide as you can go on full frame. I currently have the 10-20, which is nice and sharp and has the advantage that it can take filters whereas the 12-24 cannot. I have the 50mm f/2.8 macro mentioned above, this is a super sharp lens and a macro at a unique focal length. The 150mm macro is a legend and rightly so, a superb lens and I find also does well as a medium telephoto lens. I had a 70-300 sigma which was actually pretty good looking back. -I had but then sold a Sigma 70-200 f/2.8. This lens was too soft for me wide open, but it was significantly cheaper than the Nikon equivalent. I'm sure none of sigma zooms match up to the 2.8 \"pro\" Nikon lenses, but then most are 1/3rd the size, weight and price, which is a Good Thing in my book."}
{"doc_id": 11264853, "author": "", "text": "Kind of a long way to do it but it was the only way I can find. I wanted to find out when I subscribed to someone, so to it I went to my YouTube channel and the first thing you see when you get there is your activity on YouTube. I knew the person I was searching for I was subscribed to for about a year so what I had to do was keep scrolling down until I found when I originally subscribed. As far as I saw it won't be an exact date so in my case it said a year, it could be anywhere from a year up to a year and 11 months. You still get an estimate of when you subscribed. Sorry for the long and vague answer, but it was all I could think of."}
{"doc_id": 11248898, "author": "", "text": "Another method glossed over in @Mehper's article - zip it with a password. The .zip format supports encrypting the filenames in addition to the files, so gmail will not be able to tell the file contains an executable. Just make sure you tell the recipient the password!"}
{"doc_id": 255458, "author": "", "text": "SDHC and SDXC are descriptions of the card formats (Secure Digital High Capacity and eXtended Capacity). SDHC only supports cards of less than 32GB, while SDXC supports cards with more than 32GB. If your camera does not support SDXC, nothing you do to the card will make it work properly. The camera might see the 128GB card as a 32GB card, but the odds of failure or image corruption are high. I suspect you are out of luck with the PixPro 360, as it only states support for SDHC."}
{"doc_id": 11248894, "author": "", "text": "Thanks to the new GMail AntiVirus Scanner, you cannot send or receive emails with exe, dll, ocx, com or bat attachments even if they are sent in a zipped (.zip, .tar, .tgz, .taz, .z, .gz) format (The .rar format is still allowed). Since you cannot Turn Off GMail AntiVirus Scanning, you can use these GMail hacks to send program file (exe), virus samples and other blocked formats with GMail: Use a free file hosing online service like Rapidshare, Megaupload or Yousendit to upload your file and send the link of the uploaded file in your GMail message. Rename the file: Change the file extension to fool the GMail scanner. The new attachment could contain instructions making it easier for the recepient to derive the actuall attachment type. For instance, Rename Adobe-Reader.exe to Adobe-Reader.exe.removeme If you have lot of exe files to send, put them in a zip file and change the extension of the zip file as mentioned in the previous step. Remember that GMail denies zip attachments that contain exe files. Pass-Protection won't work either since GMail can examine exe filenames even in password protected zipped files as the archived filename listings are not encrypted by the Zip program. Use a different compression software like WinRAR which compresses files in .rar format. GMail is currently not scanning or blocking .rar filetypes. But there is a high probability that GMail might support rar formats in future. In that case, you can consider splitting the rar files and attaching them separately (like .r1, .r2..) Important: I would recommend only the first technique since all others violate Google policies and Google could even terminate your GMail account. Source: Attach and Send Any File Type with GMail Like EXE, ZIP, Videos; Trick GMail Antivirus Scanner On 05/14/2012 (today), I attempted to upload a .rar file that contained a .vb file - one of Googles banned file types. gmail does not allow .rar files containing banned file types anymore either."}
{"doc_id": 239167, "author": "", "text": "Of the three dimensions you are thinking about (left-right, up-down, fore-aft) only two are at all relevant except in macro photography. For-and-aft is not one of the axes of stabilization since it generally requires a lot of camera movement in the fore-and-aft direction to affect focus, either by moving the subject out of the depth of field that could be described as \"critically sharp\", or by changing the magnification enough to have the image begin to spill into pixels it wouldn't otherwise have hit. Conversely, it takes a very tiny amount of camera motion in the up-and-down or left-and-right directions to visibly blur images of things that aren't effectively at infinity. That leaves three axes that do affect sharpness with relatively minor camera movements: pitch (pointing the camera upwards or downwards), yaw (pointing the camera to the left or right), and roll (rotating the camera round the lens axis). All three will result in displacing the image on the sensor, causing motion blur. In addition, pitch and yaw will change the plane of focus and will cause some keystone distortion (like tilting a tilt/shift lens). The three axes of rotation (roll, pitch, and yaw) will do the most damage to the image with the least camera movement. The up-down and left-right shift, which are also necessary to correct pitch and yaw displacement (though they do nothing for keystoning or focal plane changes) just sort of come along for \"free\" (computationally speaking)."}
{"doc_id": 11249039, "author": "", "text": "Tagging is available only if you upload the video directly to Facebook—if you share the link, the video is fetched from YouTube, not Facebook so you can't tag them. Might I suggest dropping a comment and doing an @Mention?"}
{"doc_id": 11263835, "author": "", "text": "Go into the app where you originally signed up and click the option to change your password and then set one there."}
{"doc_id": 11272877, "author": "", "text": "go to https://xxluke.de/subscription-history/ enter URL of your channel hit CONTINUE button"}
{"doc_id": 11273162, "author": "", "text": "There is workaround though. If you have a Slack app that collects tokens from all you users, that app is able to access all private channels. Also see this post: https://stackoverflow.com/questions/37690761/get-a-list-of-all-private-channels-with-slack-api/53142640#53142640"}
{"doc_id": 248903, "author": "", "text": "If it is indeed a real 5D III (and not a cheaper model \"converted\" into a 5D III), it might be camera which has seem professional use. IIRC, the shutter is rated for 150.000 operations. A professional photographers can easily exceed this rating within a few months. One thing which differentiates the professional model line from the consumer model line is the ability to shoot at a higher sustained rate (high burst rates are nice, but it really sucks when the camera stalls because the burst buffer is full and your pay depends on getting a photo done in exactly that precise moment). The number of shutter cycles can be read via some software on a computer. I do not know if this number can be manipulated, but since most people don't even know about this option, sellers often give a much lower number of shutter cycles than the camera had in reality (the file/directory numbering wraps around and is no reliable indication). One other option is that the camera has been stolen. The original owner most probably knows the serial number (it's stored in every picture taken) and if this serial number resurfaces anywhere at a later point of time, you might get into trouble (it's stored in every picture...). A Google search like \"Serial number of camera 820603796\" (just a random 5D2 serial number for this example) might lead to the owner/operator of the camera (https://www.flickr.com/photos/7842697@N03/7945299606)."}
{"doc_id": 240876, "author": "", "text": "The STM version is better because it has faster, smoother AF, and the front element does not rotate. The optics are also improved which gives you better image quality. The STM focus ring is active during Auto Focus and you can small manual adjustments to focus. This is called Full Time Manual Focus. The STM version also has a much nicer EW-63C lens hood."}
{"doc_id": 220069, "author": "", "text": "My experience is that some of the primes are on a par with their Canon equivalents - the 24mm f/1.8 and the 180mm macro are really good. The AF is always much slower. I find the colour cast different to the Canon L lenses - which are consistent with each other in my experience - but haven't found this to be a problem."}
{"doc_id": 220825, "author": "", "text": "Take a look at Why don't most cameras support PNG format? for some other answers. Often cited reason is that the usual metadata (IPTC and EXIF of TIFF and JPG) is not very well supported by PNG and the software. PNG does support color profiles now, but it does not offer CMYK as TIFF does, because it is focused on web-usage. Anecdotal: I used to store 2000dpi 135er scans as PNG before I cared about metadata but the results differ not that much from TIFF with LZW+Prediction (free since 2003) in most of my cases (+25 - 50% size) that it is worth the time converting now."}
{"doc_id": 11256860, "author": "", "text": "There is no way to see if chats were deleted, unless someone saved the page before the fact. But there is a way to see if the message was read, archived or classified as spam"}
{"doc_id": 11273090, "author": "", "text": "As of May 2019 Slack's privacy FAQ states that on a free plan, owners can request an export of all data, including private messages and channels. However, they must \"provide (a) valid legal process, (b) consent of members, or (c) a requirement or right under applicable laws.\""}
{"doc_id": 238632, "author": "", "text": "A 2 megapixel camera produces 6 mb of data- 1 byte per color * 3 colors / pixel * 2M pixels. However, file sizes are much smaller because of the jpeg compression applied. The reason why the corrupted files were so large must be because there was a very high degree of randomness due to the corruption, and more randomness means less possible compression."}
{"doc_id": 241735, "author": "", "text": "Impossible, I'm afraid. Video is just so much of a fundamental change that there's no way a manufacturer, or anyone else, could add it to a camera by a firmware update or similar even if they wanted to."}
{"doc_id": 214076, "author": "", "text": "Most standard because: 50mm on a full frame is said to give a natural field of view. 50mm is apparently an simple focal length to design On a your crop sensor, it is 75e, while the 35mm is 52.5e. Thus, the 35mm lens will be closer to \"normal\" Reasons why most photographers may choose the 50mm could be to use it for portraits on crop sensors. 75e is a great focal length for portraits, especially when combined with such a wide aperture. Other reasons may include: higher resolution, smoother bokeh, better color, better rendition, higher contrast and microcontrast, more flare resistance, less CA, less distortion, less vignetting, better build quality, faster AF, etc."}
{"doc_id": 11258617, "author": "", "text": "If you are using an Android Phone, you can use Onliner for Facebook. You can track your friends, and it will notify you when any of them come online."}
{"doc_id": 11252953, "author": "", "text": "It was happening to me also and I have no one in my \"close friends\" list and had those notifications turned off. I found this online: When one of those newsfeed updates pops up in your red flag notifications here's what you do. Click the world so you see notifications as that little drop down menu. Run your mouse over the offending notification and look for a little 'x' in the top right hand corner. When you put your mouse over the 'x' it says 'turn off'. Click the 'x' to turn off these \"activity notifications.\""}
{"doc_id": 11261259, "author": "", "text": "No, it means that the person has a friend request in their account and they have not yet accepted it. If you click on \"Cancel\", then that will remove the friend request from their account, and Facebook would give you the option to send another friend request."}
{"doc_id": 11260410, "author": "", "text": "I noticed one feature in Google Drive that is relevant here: Link lookup by text: you type in a text for the link, then you select it and press Ctrl+K. A dialog appears with two fields, and the field for the URL has drop-down list with suggestions that match the text. So this allows emulate easily some wiki-like functionality."}
{"doc_id": 11251671, "author": "", "text": "To change your login email address: Open the Account dropdown menu at the top right corner of Facebook and choose Account Settings. Click the Edit link next to Email. Click Add another email. Type your new email address in the open field and click Save Changes. You will be asked to enter your password for security purposes. You will then be sent a confirmation email to the new email address. You will not be able to log in with the new address until it is confirmed. Note: Any of the email addresses associated with your account can be used as login email addresses. If you are having trouble accessing an existing account on the site, please do not create another account, as this is a violation of our Terms of Use and may delay resolution of the issue. From the Facebook help page."}
{"doc_id": 11263837, "author": "", "text": "When you login account using Facebook it synchronize your account with Facebook by using details from Facebook and didn't ask for password. But when you login account from a separate device or PC, it will ask for the password. See from the Instagram Help Center how to reset/create a new password: If you can't remember your password, you can reset it through your email address or your Facebook account. To reset your password, first tap Forgot? next to Password on the log in screen. To reset through your email address, tap Username or Email, enter your username or the email address you used to create your account and tap search. Choose Send a Password Reset Email. To reset through Facebook, tap Reset using Facebook. You may be asked to log into Facebook. You can then enter a new password for the Instagram account that was most recently linked to your Facebook account. If you can't access the email you registered with and you didn't link your Instagram account to Facebook, we're not able to give you access to this account. For above activity I would suggest instead of app, go to instagram.com and change password."}
{"doc_id": 227893, "author": "", "text": "If you are talking strictly about DSLRs based on the 35mm film format (and even most crop sensor DSLRs are designed around the 35mm lens mount their manufacturers used pre-digital), then the price/performance ratio is intrinsic to the 50mm focal length (or thereabouts). First, there's the distance between the back of the lens and the sensor. That's pretty much set in stone for the 35mm SLR format, since the camera needs to accommodate a mirror, focusing screen and focal plane shutter. A 40mm distance between the surface of the lens mount and the film plane is just about an absolute minimum, and the rear of the lens can only protrude so far into the camera before it begins to interfere with the mirror. (Canon EF-S lenses protrude a little deeper than their EF brethren, but only by a a little—there's still a mirror to contend with, even if it's a little smaller. Some very old wide-angle lens designs require that the mirror be locked up before the lens is mounted, but for reasons I'll discuss later, they're not useful on DSLRs.) For a lens to have an apparent focal length shorter than the distance between it and the sensor, it needs to have a retrofocus design, which consists of a telephoto lens looking through a rather large concave lens at the world. That concave lens (or group) needs to be much larger in diameter than the focal length and speed of the lens would suggest. Such a design will always be more expensive than the simpler design possible with a 50mm. But what of the 40mm-ish range? It is indeed a simple thing to make something very simple using a Tessar-type design at or around the 40mm range. That's why the Pentax and Canon \"pancake\" lenses can be so small. But notice that they're also of limited maximum aperture. (\"Limited\", here, is relative. A speed of f/2.8 is fast except in comparison to the f/1.8 and faster lenses we're talking about.) The fact of the matter is that a 40mm lens has to bend light much more abruptly than a 50mm lens does, and to get a large image circle with little vignetting and acceptable levels of aberration and distortion, you need either to restrict the diameter of the lens or use a more complex design. That more complex design will, of necessity, be physically longer, moving the optical centre of the lens farther from the sensor, and suddenly we're back in retrofocus territory. Once we get beyond the 50mm focal length, the lens design can remain relatively simple, at least for a while, but all of the elements need to be physically larger, so the prices go up again. And because the prices go up, the prices go up—fewer people will buy the lens, so each copy is going to cost a little more. But it doesn't take long before we run into chromatic aberration in a big way: since the light has more distance to spread out, the separation of the spectrum becomes more apparent, and the lens design needs to correct more for it. That usually involves using expensive and hard-to-work-with exotic materials to get as close as possible to apochromatic performance. The 50mm lies in the sweet spot. It doesn't need be be retrofocus (unless the design is deliberately exotic), and doesn't need heroic levels of correction in order to acheive a large enough image circle and acceptable levels of aberration and distortion. It's also just about the shortest focal length where all of the forces of good gather, so its elements are small compared to lenses of a longer focal length. (Note that there is a reason why even the 50mm gets much more expensive as you get faster than f/1.8.) That makes it intrinsically cheap, and it helps, of course, that the lens body is usually of a somewhat lower quality than the more expensive lenses (particularly in Canon's case). So this should all get better in the mirrorless world, right? Well, yes and no. A digital camera's sensor isn't film. In almost all cases, there is a Bayer pattern filter or something similar to distinguish colours and an array of microlenses to ensure that each of the sensor elements receives as much light as possible. The upshot of that is that there is a limited range of angles from which the sensor can receive light efficiently, and that means that shorter focal lengths still need to be retrofocus even though the rear of the lens can almost touch the sensor. (The alternative would be to force all longer focal lengths to be true telephoto lenses—lenses that have a focal length longer than their physical length, and which usually have smaller image circles and maximum apertures than simple long-focus lenses. That would get you cheaper wide-angles, but would make anything longer than your nominal \"normal\" much, much more expensive—there is a genuine requirement to have fast long lenses in order to keep the shutter speeds high.)"}
{"doc_id": 232236, "author": "", "text": "Compactflash cards are much more sturdy. SD cards flex and get squashed, so unless you have them on your camera (like if you carry extra like most serious photographers) it is much better to use CF cards. They also have better bandwidth with more pins, but mostly you wont notice that since the camera interface and cardreaders cannot fully utilize it unless you get the best of the best gear. You can get 10$ cardreaders and 50$ cardreaders, and you really feel the difference. I had a sandisk extreme III CF card and used a 10$ reader, and the transfer time was 1.5mb/s. Then I got a sandisk extreme reader for 50$ and suddenly it was 20mb/s. The studiness feature is so high a priority for me that I look for the CF slot in camera specs as a dealbreaker kinda thing. Ive had too many SD cards break , and seen other people complain that all their confeirence shots were lost on a sd card, that I avoid them. I've never seen a broken CF card. Not that I claim it cant happen, just that the frequency is so low that I havent encountered one, in the same time I encountered multiple broken SD cards."}
{"doc_id": 249529, "author": "", "text": "Sure, if your picture is exported in JPEG, it's safe to do whatever you want on the RAW source. XMP files are just an archived history of the processing stages on the RAW file (settings and parameters used), it has nothing to do with the exported JPEG. However, I would not recommend to delete the XMP files. First, it's just a few more kilobytes (like a droplet in the ocean of heavy RAW files), and second, your future self might be happy to have them (to keep track of your editing, rework on the file, see how you improved in editing, etc.)."}
{"doc_id": 11262533, "author": "", "text": "The last online time is typically shown based on when they are last online on the chat from their phones as indicated by the little cellphone symbol beside their last online time. You cannot control whether or not people see your last online time."}
{"doc_id": 11258881, "author": "", "text": "buddybuzzer is a cool app for Android. It doesn't have too many things to confuse. Have some added features like ring notification. Simple but useful."}
{"doc_id": 216502, "author": "", "text": "It's actually just happenstance. The 35mm film still format was developed from an existing 35mm cine format, shot \"sideways\" to increase the image size, and the 2-inch cine lens was a cheap off-the-shelf lens at the time. Both decisions were cost-saving measures; 35mm film allowed the use of film ends, the unexposed bits at the end of, say, a 400-foot roll of film, and the 2-inch lens (a common, simple, easy-to-produce design) had the needed image circle while still being cheap enough. All of these decisions were made before a 35mm rangefinder camera was made, let alone a SLR. 50mm is actually rather long for a \"normal lens\". Consider that a 35mm frame is 24mm by 36mm. A square medium format camera has a frame that is 56mm by 56mm, and the \"normal\" lens for that format is 80mm; 150mm is considered \"normal\" for a 4x5 (inch) camera (think Speed Graphic)."}
{"doc_id": 243609, "author": "", "text": "You are confusing weatherproof and freezeproof. Some digital cameras are weatherproof but not freezeproof, although all current freezeproof cameras are weatherproof. Weatherproof generally means that the camera can be splashed with water from any direction without water entering the camera. There are standards to measure this but most camera makers are rather vague when describing their weatherproof cameras. Keep in mind that: Not all weatherproof cameras are equally solid. Some only handle a little rain, some plenty and some even can be rinsed with some pressure. Weatherpoof is not waterproof either. Unless a camera is waterproof, it cannot be submerged. For an interchangeable lens camera, you must use a weatherproof camera and a weatherproof lens for the whole thing to be weatherproof. For a non-weatherproof camera, there are no guaranties but most will handle snow and even a few drops of rain. You don't have to worry for each drop but you should wide the camera dry as often as possible. If water enters the camera, it can cause a short-circuit and permanently damage it. There are rain-covers you can buy for non-weatherproof cameras to protect them. Freezeproof means the camera can operate normally below freezing, usually up to -10C (14F). This is the temperature the camera has been tested against but this not mean it will stop operating below. All other cameras are expected to operate normally until 0C (32F). Below the minimum operating temperature: Battery life will be significantly shorter and will eventually stop working entirely. This is temporary in most cases. When the battery warms up, it will generate current again. A trick I use it to keep the second battery in my glove so that it stays warm, when the one in the camera stops working, I swap the batteries and repeat this until they are actually depleted. A battery which freezes completely can be permanently damaged. Unfortunately you cannot tell by looking at it. From experience (I live in Montreal), down to -20C for a freezeproof camera or to -10C for one that isn't there are no problems. The body or lens are unlikely to be damaged by cold unless it is extreme. Some lenses though sometimes become very hard to zoom and stop focusing as the internal lubricant freezes. The LCD and EVF are mostly made of liquid crystals which slow down and eventually freeze. They will start being less responsive and eventually not form an image until warmed up again. There are new OLED displays. I have no idea how those will react, if someone knows, feel free to add details to this answer."}
{"doc_id": 11267014, "author": "", "text": "I believe it is because there is a time frame set automatically. From what I have noticed is that if someone has been off chat after the 24 hour mark, the time automatically stops accumulating. The only thing you will see at this point is the person's name only. I have paid attention to this pretty good so I am confident that this is the reason. In other words there is not time displayed beside a persons name after 24 have passed since their last chat log on."}
{"doc_id": 11266232, "author": "", "text": "Generally it takes 48 hours to 1 week. And you will receive notification once it get verified. Sometimes it takes more time and sometimes you will never receive any communication from Facebook. It totally depends on what kind of page you have and what information you are providing. If they find it genuine they will verify your page and you will get a notification, if not they will ignore it."}
{"doc_id": 232235, "author": "", "text": "There is an advantage to Compact-Flash cards which you get with the fastest models and sufficiently fast camera. This is not what accounts for most of the price difference, volume is. SD cards are sold on considerably higher volume than CF ones. When CF cards were more popular, it used to be the opposite. Nowadays, I would not worry at all about this. The most advantageous card is the one that fits in your camera! If you are choosing a camera, there are certainly much more significant differences to worry about than what memory cards they take. For a camera that accepts both, if you want the fastest get CF. If you want to replication, you will need both. BTW, I have covered the technical differences here. They do not explain the price difference but may be interesting to know."}
{"doc_id": 11252054, "author": "", "text": "Click \"Share\" under the video on YouTube then click on the Facebook icon—a little window should come up. In that window, there is a small box that says \"Whats on your mind\"; in it type @friends name. For example @candice ramkissoon."}
{"doc_id": 232524, "author": "", "text": "As on all DSLRs, the lens has a manual zoom. I assume that you are in live view (using the LCD screen to frame the scene), and the plus and minus buttons are just magnifying that view to help you focus."}
{"doc_id": 224939, "author": "", "text": "No adapters on DSLR bodies support autofocus. On mirrorless bodies, there is an autofocus adapter for Sony/Minolta AF lenses on Sony NEX cameras. Nikon F-mount in general is notorious for not being able to adapt any other 35mm lenses, and retain infinity focus."}
{"doc_id": 11251197, "author": "", "text": "If they are on your \"Close Friends\" list then by default you will be notified whenever they post. To turn that off, click on \"Close Friends\" in the left sidebar (if it is not there then click \"More\" next to \"Lists\" and then click \"Close Friends\"). Then click on \"Notifications\" at the top and choose \"Off\". Of course you could also remove the person from your \"Close Friends\" list. Groups are the same way. If you do not want to receive notifications for posts to the group, click on the group name, then Notifications at the top of the page and choose \"Off\"."}
